num = int(input("Введіть 5-ти значне число: "))


while num < 10000 or num > 99999:
    num = int(input("Введіть 5-ти значне число: "))

"""
Варіант 1: цифри в зворотному порядку, але з нової строки

print(num % 10) # 5
print(num % 10 ** 2 // 10) # 4
print(num % 10 ** 3 // 10 ** 2) # 3
print(num % 10 ** 4 // 10 ** 3) # 2
print(num // 10000) # 1
"""

print("Варіант 1:")
print("# Опис в коментарі")
print()

# Варіант 2: виконано через 1 print(), але це не є одним числом, для вигляду прибрано проміжок між аргументами
print("Варіант 2:")

print(num % 10, num % 10 ** 2 // 10, num % 10 ** 3 // 10 ** 2, num % 10 ** 4 // 10 ** 3, num // 10000, sep = "")

print()

"""
Варіант 3:  тут ми отримаємо ціле число. Зроблено не дуже читаємо,
            але свою справу робить добре.
            Спочатку отримуємо потрібну цифру, переводимо її до типу <str>,
            так робимо з кожною цифрою, кожну з них конкатенуємо між собою,
            після цього цей весь рядок записуємо в змінну в вигляді типу <int>
"""

print("Варіант 3:")

result = int(str(num % 10) + str(num % 10 ** 2 // 10) + str(num % 10 ** 3 // 10 ** 2) + str(num % 10 ** 4 // 10 ** 3) + str(num // 10000))
print(result, type(result))

print()

# Варіант 4: якщо використовувати строки, хоча по завданню це робити не можна
print("Варіант 4:")

print(str(num)[::-1])

print()

# Варіант 5: використовуючи результат варіанта 4, можна отримати число, як у варіанті 3
print("Варіант 5:")

result = int(str(num)[::-1])
print(result, type(result))

print()